{"class_name": "Model", "keras_version": "2.0.7", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 10, 100, 1], "name": "input_1", "sparse": false}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "filters": 32, "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 10, 100, 1], "use_bias": true, "activity_regularizer": null, "kernel_size": [4, 4]}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_2", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2, 2]}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "conv2d_2"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_3", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2, 2]}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "conv2d_3"}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "padding": "valid", "strides": [3, 3]}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "max_pooling2d_1"}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_1"}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "dropout_1"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "flatten_1"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_2", "sparse": false}, "inbound_nodes": [], "name": "input_2"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_3", "sparse": false}, "inbound_nodes": [], "name": "input_3"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_4", "sparse": false}, "inbound_nodes": [], "name": "input_4"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_5", "sparse": false}, "inbound_nodes": [], "name": "input_5"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_6", "sparse": false}, "inbound_nodes": [], "name": "input_6"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_7", "sparse": false}, "inbound_nodes": [], "name": "input_7"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_8", "sparse": false}, "inbound_nodes": [], "name": "input_8"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_9", "sparse": false}, "inbound_nodes": [], "name": "input_9"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_10", "sparse": false}, "inbound_nodes": [], "name": "input_10"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_11", "sparse": false}, "inbound_nodes": [], "name": "input_11"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_12", "sparse": false}, "inbound_nodes": [], "name": "input_12"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_13", "sparse": false}, "inbound_nodes": [], "name": "input_13"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_14", "sparse": false}, "inbound_nodes": [], "name": "input_14"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_15", "sparse": false}, "inbound_nodes": [], "name": "input_15"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_16", "sparse": false}, "inbound_nodes": [], "name": "input_16"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_17", "sparse": false}, "inbound_nodes": [], "name": "input_17"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_18", "sparse": false}, "inbound_nodes": [], "name": "input_18"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_19", "sparse": false}, "inbound_nodes": [], "name": "input_19"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_20", "sparse": false}, "inbound_nodes": [], "name": "input_20"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_21", "sparse": false}, "inbound_nodes": [], "name": "input_21"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_22", "sparse": false}, "inbound_nodes": [], "name": "input_22"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_23", "sparse": false}, "inbound_nodes": [], "name": "input_23"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_24", "sparse": false}, "inbound_nodes": [], "name": "input_24"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_25", "sparse": false}, "inbound_nodes": [], "name": "input_25"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_26", "sparse": false}, "inbound_nodes": [], "name": "input_26"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_27", "sparse": false}, "inbound_nodes": [], "name": "input_27"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_28", "sparse": false}, "inbound_nodes": [], "name": "input_28"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_29", "sparse": false}, "inbound_nodes": [], "name": "input_29"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_30", "sparse": false}, "inbound_nodes": [], "name": "input_30"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_31", "sparse": false}, "inbound_nodes": [], "name": "input_31"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_32", "sparse": false}, "inbound_nodes": [], "name": "input_32"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_33", "sparse": false}, "inbound_nodes": [], "name": "input_33"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_34", "sparse": false}, "inbound_nodes": [], "name": "input_34"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_35", "sparse": false}, "inbound_nodes": [], "name": "input_35"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_36", "sparse": false}, "inbound_nodes": [], "name": "input_36"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_37", "sparse": false}, "inbound_nodes": [], "name": "input_37"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_38", "sparse": false}, "inbound_nodes": [], "name": "input_38"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_39", "sparse": false}, "inbound_nodes": [], "name": "input_39"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_40", "sparse": false}, "inbound_nodes": [], "name": "input_40"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_41", "sparse": false}, "inbound_nodes": [], "name": "input_41"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_42", "sparse": false}, "inbound_nodes": [], "name": "input_42"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_43", "sparse": false}, "inbound_nodes": [], "name": "input_43"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_44", "sparse": false}, "inbound_nodes": [], "name": "input_44"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_45", "sparse": false}, "inbound_nodes": [], "name": "input_45"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_46", "sparse": false}, "inbound_nodes": [], "name": "input_46"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_47", "sparse": false}, "inbound_nodes": [], "name": "input_47"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_48", "sparse": false}, "inbound_nodes": [], "name": "input_48"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_49", "sparse": false}, "inbound_nodes": [], "name": "input_49"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_50", "sparse": false}, "inbound_nodes": [], "name": "input_50"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_51", "sparse": false}, "inbound_nodes": [], "name": "input_51"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_52", "sparse": false}, "inbound_nodes": [], "name": "input_52"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_53", "sparse": false}, "inbound_nodes": [], "name": "input_53"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_54", "sparse": false}, "inbound_nodes": [], "name": "input_54"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_55", "sparse": false}, "inbound_nodes": [], "name": "input_55"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_56", "sparse": false}, "inbound_nodes": [], "name": "input_56"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_57", "sparse": false}, "inbound_nodes": [], "name": "input_57"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_58", "sparse": false}, "inbound_nodes": [], "name": "input_58"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_59", "sparse": false}, "inbound_nodes": [], "name": "input_59"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_60", "sparse": false}, "inbound_nodes": [], "name": "input_60"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_61", "sparse": false}, "inbound_nodes": [], "name": "input_61"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_62", "sparse": false}, "inbound_nodes": [], "name": "input_62"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_63", "sparse": false}, "inbound_nodes": [], "name": "input_63"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_64", "sparse": false}, "inbound_nodes": [], "name": "input_64"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_65", "sparse": false}, "inbound_nodes": [], "name": "input_65"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_66", "sparse": false}, "inbound_nodes": [], "name": "input_66"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_67", "sparse": false}, "inbound_nodes": [], "name": "input_67"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_68", "sparse": false}, "inbound_nodes": [], "name": "input_68"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_69", "sparse": false}, "inbound_nodes": [], "name": "input_69"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_70", "sparse": false}, "inbound_nodes": [], "name": "input_70"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_71", "sparse": false}, "inbound_nodes": [], "name": "input_71"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_72", "sparse": false}, "inbound_nodes": [], "name": "input_72"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_73", "sparse": false}, "inbound_nodes": [], "name": "input_73"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_74", "sparse": false}, "inbound_nodes": [], "name": "input_74"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_75", "sparse": false}, "inbound_nodes": [], "name": "input_75"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_76", "sparse": false}, "inbound_nodes": [], "name": "input_76"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_77", "sparse": false}, "inbound_nodes": [], "name": "input_77"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_78", "sparse": false}, "inbound_nodes": [], "name": "input_78"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_79", "sparse": false}, "inbound_nodes": [], "name": "input_79"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_80", "sparse": false}, "inbound_nodes": [], "name": "input_80"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_81", "sparse": false}, "inbound_nodes": [], "name": "input_81"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_82", "sparse": false}, "inbound_nodes": [], "name": "input_82"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_83", "sparse": false}, "inbound_nodes": [], "name": "input_83"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_84", "sparse": false}, "inbound_nodes": [], "name": "input_84"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_85", "sparse": false}, "inbound_nodes": [], "name": "input_85"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_86", "sparse": false}, "inbound_nodes": [], "name": "input_86"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_87", "sparse": false}, "inbound_nodes": [], "name": "input_87"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_88", "sparse": false}, "inbound_nodes": [], "name": "input_88"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_89", "sparse": false}, "inbound_nodes": [], "name": "input_89"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_90", "sparse": false}, "inbound_nodes": [], "name": "input_90"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_91", "sparse": false}, "inbound_nodes": [], "name": "input_91"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_92", "sparse": false}, "inbound_nodes": [], "name": "input_92"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_93", "sparse": false}, "inbound_nodes": [], "name": "input_93"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_94", "sparse": false}, "inbound_nodes": [], "name": "input_94"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_95", "sparse": false}, "inbound_nodes": [], "name": "input_95"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_96", "sparse": false}, "inbound_nodes": [], "name": "input_96"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_97", "sparse": false}, "inbound_nodes": [], "name": "input_97"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_98", "sparse": false}, "inbound_nodes": [], "name": "input_98"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_99", "sparse": false}, "inbound_nodes": [], "name": "input_99"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_100", "sparse": false}, "inbound_nodes": [], "name": "input_100"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 10], "name": "input_101", "sparse": false}, "inbound_nodes": [], "name": "input_101"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "dense_1"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_1", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "conv1d_1"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_2", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_3", 0, 0, {}]]], "name": "conv1d_2"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_3", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_4", 0, 0, {}]]], "name": "conv1d_3"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_4", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_5", 0, 0, {}]]], "name": "conv1d_4"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_5", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_6", 0, 0, {}]]], "name": "conv1d_5"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_6", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_7", 0, 0, {}]]], "name": "conv1d_6"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_7", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_8", 0, 0, {}]]], "name": "conv1d_7"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_8", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_9", 0, 0, {}]]], "name": "conv1d_8"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_9", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_10", 0, 0, {}]]], "name": "conv1d_9"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_10", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_11", 0, 0, {}]]], "name": "conv1d_10"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_11", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_12", 0, 0, {}]]], "name": "conv1d_11"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_12", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_13", 0, 0, {}]]], "name": "conv1d_12"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_13", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_14", 0, 0, {}]]], "name": "conv1d_13"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_14", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_15", 0, 0, {}]]], "name": "conv1d_14"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_15", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_16", 0, 0, {}]]], "name": "conv1d_15"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_16", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_17", 0, 0, {}]]], "name": "conv1d_16"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_17", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_18", 0, 0, {}]]], "name": "conv1d_17"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_18", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_19", 0, 0, {}]]], "name": "conv1d_18"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_19", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_20", 0, 0, {}]]], "name": "conv1d_19"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_20", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_21", 0, 0, {}]]], "name": "conv1d_20"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_21", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_22", 0, 0, {}]]], "name": "conv1d_21"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_22", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_23", 0, 0, {}]]], "name": "conv1d_22"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_23", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_24", 0, 0, {}]]], "name": "conv1d_23"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_24", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_25", 0, 0, {}]]], "name": "conv1d_24"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_25", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_26", 0, 0, {}]]], "name": "conv1d_25"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_26", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_27", 0, 0, {}]]], "name": "conv1d_26"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_27", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_28", 0, 0, {}]]], "name": "conv1d_27"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_28", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_29", 0, 0, {}]]], "name": "conv1d_28"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_29", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_30", 0, 0, {}]]], "name": "conv1d_29"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_30", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_31", 0, 0, {}]]], "name": "conv1d_30"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_31", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_32", 0, 0, {}]]], "name": "conv1d_31"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_32", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_33", 0, 0, {}]]], "name": "conv1d_32"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_33", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_34", 0, 0, {}]]], "name": "conv1d_33"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_34", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_35", 0, 0, {}]]], "name": "conv1d_34"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_35", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_36", 0, 0, {}]]], "name": "conv1d_35"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_36", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_37", 0, 0, {}]]], "name": "conv1d_36"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_37", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_38", 0, 0, {}]]], "name": "conv1d_37"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_38", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_39", 0, 0, {}]]], "name": "conv1d_38"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_39", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_40", 0, 0, {}]]], "name": "conv1d_39"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_40", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_41", 0, 0, {}]]], "name": "conv1d_40"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_41", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_42", 0, 0, {}]]], "name": "conv1d_41"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_42", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_43", 0, 0, {}]]], "name": "conv1d_42"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_43", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_44", 0, 0, {}]]], "name": "conv1d_43"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_44", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_45", 0, 0, {}]]], "name": "conv1d_44"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_45", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_46", 0, 0, {}]]], "name": "conv1d_45"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_46", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_47", 0, 0, {}]]], "name": "conv1d_46"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_47", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_48", 0, 0, {}]]], "name": "conv1d_47"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, 